---
kind: type
id: T:Autodesk.Revit.DB.MEPSize
source: html/475cd9a4-e87a-6f9f-7e75-c079ac004166.htm
---
# Autodesk.Revit.DB.MEPSize

Stores the basic size information for an MEP duct, pipe, cable tray, or conduit.

## Syntax (C#)
```csharp
public class MEPSize : IDisposable
```